In [5]:
import pandas as pd

df = pd.read_excel('xls/Canada.xlsx',sheet_name='Canada by Citizenship',skiprows=range(20),skipfooter=2)

df.head()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1,...,1450,1223,856,702,560,716,561,539,620,603
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0,...,0,0,1,1,0,0,0,0,1,1

In [8]:
df_can = df.drop(['Type','Coverage','AREA','AreaName','REG','RegName','DEV','DevName'],axis=1)

,OdName,1980,1981,1982,1983,1984,1985,1986,1987,1988,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,16,39,39,47,71,340,496,741,828,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Albania,1,0,0,0,0,0,1,2,2,...,1450,1223,856,702,560,716,561,539,620,603
2,Algeria,80,67,71,69,63,44,69,132,242,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,American Samoa,0,1,0,0,0,0,0,1,0,...,0,0,1,0,0,0,0,0,0,0
4,Andorra,0,0,0,0,0,0,2,0,0,...,0,0,1,1,0,0,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
190,Viet Nam,1191,1829,2162,3404,7583,5907,2741,1406,1411,...,1816,1852,3153,2574,1784,2171,1942,1723,1731,2112
191,Western Sahara,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
192,Yemen,1,2,1,6,0,18,7,12,7,...,124,161,140,122,133,128,211,160,174,217
193,Zambia,11,17,11,7,16,9,15,23,44,...,56,91,77,71,64,60,102,69,46,59
194,Zimbabwe,72,114,102,44,32,29,43,68,99,...,1450,615,454,663,611,508,494,434,437,407

In [19]:
df_can_trans = df_can.melt(id_vars=['OdName'], var_name=['Year'], value_vars='Values')

In [20]:
df_can_trans.head()

           OdName  Year  value
0     Afghanistan  2013   2004
1         Albania  2013    603
2         Algeria  2013   4331
3  American Samoa  2013      0
4         Andorra  2013      1